In [2]:
import pandas
pandas

In [ ]:
__init__()   constructor in class   vs   __init__.py   Package

dir1
|---p1.py
|---p2.py
|---p3.py
|---__init__.py (package file-->import modulenames..

In [5]:
print(pandas.Series)

<class 'pandas.core.series.Series'>

In [4]:
print(pandas.DataFrame)

<class 'pandas.core.frame.DataFrame'>

In [ ]:
pandas/
|
-----core/
       |----frame.py
                |------class Dataframe

In [6]:
import pandas as pd
pd.Series([10,20,30,40])

0    10
1    20
2    30
3    40
dtype: int64

In [7]:
pd.DataFrame([10,20,30,40])

    0
0  10
1  20
2  30
3  40

In [10]:
products={}
products['pid']=[101,102,103,104]
products['pname']=['pA','pB','pC','pD']
products['pcost']=[1000,2000,3000,4000]
products

{'pid': [101, 102, 103, 104],
 'pname': ['pA', 'pB', 'pC', 'pD'],
 'pcost': [1000, 2000, 3000, 4000]}

In [14]:
pd.DataFrame(products)

   pid pname  pcost
0  101    pA   1000
1  102    pB   2000
2  103    pC   3000
3  104    pD   4000

In [15]:
df=pd.DataFrame(products)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   pid     4 non-null      int64
 1   pname   4 non-null      object
 2   pcost   4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [16]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [18]:
df.columns

Index(['pid', 'pname', 'pcost'], dtype='object')

In [19]:
# To fetch data - row based ==>   df.loc[index]-> record
#

In [21]:
df.loc[1]

pid       102
pname      pB
pcost    2000
Name: 1, dtype: object

In [22]:
df.loc[0]

pid       101
pname      pA
pcost    1000
Name: 0, dtype: object

In [ ]:
#To fetch column => df[columnname] -> column

In [23]:
df['pid']

0    101
1    102
2    103
3    104
Name: pid, dtype: int64

In [24]:
df['pname']

0    pA
1    pB
2    pC
3    pD
Name: pname, dtype: object

In [ ]:
# df=pf.dataFrame(d)
#df.info()
#df.index
#df.columns
#df.loc[index]
#df['columnName']

In [25]:
df

   pid pname  pcost
0  101    pA   1000
1  102    pB   2000
2  103    pC   3000
3  104    pD   4000

In [27]:
df.loc[1]['pname']

'pB'

In [ ]:
#Task
# Add more product - dict-- do append operation
#     |-------------> initialze a DataFrame 
 #                                |-----------------fetch Row
                                #|---------------fetch column

In [29]:
df.loc[1].to_frame()

          1
pid     102
pname    pB
pcost  2000

In [31]:
df.loc[[1]].T

          1
pid     102
pname    pB
pcost  2000

In [32]:
products={}
products['pid']=[101,102,103,104]      
products['pname']=['pA','pB','pC','pD']
products['pcost']=[1000,2000,3000,4000]

In [33]:
L=[105,106,107]
products['pid']=products['pid']+L
products['pid']

[101, 102, 103, 104, 105, 106, 107]

In [34]:
products={}
products['pid']=[101,102,103,104]      
products['pname']=['pA','pB','pC','pD']
products['pcost']=[1000,2000,3000,4000]

products['pid'].append(104)
products['pname'].append('pD')
products['pcost'].append(4000)

products['pid'].append(105)
products['pname'].append('pE')
products['pcost'].append(6000)

products['pid'].append(106)
products['pname'].append('pF')
products['pcost'].append(7000)

products['pid'].append(107)
products['pname'].append('pG')
products['pcost'].append(8000)

In [35]:
df2=pd.DataFrame(products)
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   pid     8 non-null      int64
 1   pname   8 non-null      object
 2   pcost   8 non-null      int64
dtypes: int64(2), object(1)
memory usage: 324.0+ bytes

In [36]:
df2['pid']

0    101
1    102
2    103
3    104
4    104
5    105
6    106
7    107
Name: pid, dtype: int64

In [37]:
df2.loc[2]

pid       103
pname      pC
pcost    3000
Name: 2, dtype: object

In [39]:
df2.loc[2]

pid       103
pname      pC
pcost    3000
Name: 2, dtype: object

In [40]:
df2.loc[2:]   # from 2nd index to list of all - Slicing

   pid pname  pcost
2  103    pC   3000
3  104    pD   4000
4  104    pD   4000
5  105    pE   6000
6  106    pF   7000
7  107    pG   8000

In [41]:
df2.loc[2:5]

   pid pname  pcost
2  103    pC   3000
3  104    pD   4000
4  104    pD   4000
5  105    pE   6000

In [42]:
df2.loc[:3]

   pid pname  pcost
0  101    pA   1000
1  102    pB   2000
2  103    pC   3000
3  104    pD   4000

In [43]:
df2.loc[:]  # is same as df2

   pid pname  pcost
0  101    pA   1000
1  102    pB   2000
2  103    pC   3000
3  104    pD   4000
4  104    pD   4000
5  105    pE   6000
6  106    pF   7000
7  107    pG   8000

In [ ]:
# df=pf.dataFrame(d)
#df.info()
#df.index
#df.columns
#df.loc[index]
#df['columnName']
#df.loc[index]['columnName']
#df.loc[n:]
#df.loc[:m]
#df.loc[n:m]

In [44]:
df2.loc[[2,5]]

   pid pname  pcost
2  103    pC   3000
5  105    pE   6000

In [45]:
df2

   pid pname  pcost
0  101    pA   1000
1  102    pB   2000
2  103    pC   3000
3  104    pD   4000
4  104    pD   4000
5  105    pE   6000
6  106    pF   7000
7  107    pG   8000

In [46]:
df2.loc[[2,5,7]]

   pid pname  pcost
2  103    pC   3000
5  105    pE   6000
7  107    pG   8000

In [ ]:
#  df2[[2,5]]            vs     df2[2:5]

In [49]:
df2.loc[2:5]

   pid pname  pcost
2  103    pC   3000
3  104    pD   4000
4  104    pD   4000
5  105    pE   6000

In [50]:
df2.loc[[2,5]]

   pid pname  pcost
2  103    pC   3000
5  105    pE   6000

In [51]:
df2.loc[3]['pname']

'pD'

In [52]:
df2.loc[3]

pid       104
pname      pD
pcost    4000
Name: 3, dtype: object

In [53]:
df2.loc[3]['pname']

'pD'

In [54]:
df2.loc[3][['pname','pcost']]

pname      pD
pcost    4000
Name: 3, dtype: object

In [55]:
df2.loc[2:5]

   pid pname  pcost
2  103    pC   3000
3  104    pD   4000
4  104    pD   4000
5  105    pE   6000

In [56]:
df2.loc[2:5][['pname','pcost']]  # from rnd row to 5th row- filter productName,productCost

  pname  pcost
2    pC   3000
3    pD   4000
4    pD   4000
5    pE   6000

In [59]:
df2.loc[2:5]['pname']   # Series Format result

2    pC
3    pD
4    pD
5    pE
Name: pname, dtype: object

In [60]:
df2.loc[2:5][['pname']]   # DataFrame Format

  pname
2    pC
3    pD
4    pD
5    pE

In [61]:
# filter productId and productName from 5th record to list of all 
df2.loc[5:][['pid','pname']]

   pid pname
5  105    pE
6  106    pF
7  107    pG

In [62]:
df2.loc[5:][['pid','pname']].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 5 to 7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   pid     3 non-null      int64
 1   pname   3 non-null      object
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [63]:
df2.loc[5:][['pid','pname']].index

RangeIndex(start=5, stop=8, step=1)

In [64]:
df2.loc[5:][['pid','pname']].columns

Index(['pid', 'pname'], dtype='object')

In [65]:
df2['pcost']

0    1000
1    2000
2    3000
3    4000
4    4000
5    6000
6    7000
7    8000
Name: pcost, dtype: int64

In [66]:
df2['pcost'] * 0.18

0     180.0
1     360.0
2     540.0
3     720.0
4     720.0
5    1080.0
6    1260.0
7    1440.0
Name: pcost, dtype: float64

In [67]:
df2

   pid pname  pcost
0  101    pA   1000
1  102    pB   2000
2  103    pC   3000
3  104    pD   4000
4  104    pD   4000
5  105    pE   6000
6  106    pF   7000
7  107    pG   8000

In [68]:
df2['pcost'] > 3000

0    False
1    False
2    False
3     True
4     True
5     True
6     True
7     True
Name: pcost, dtype: bool

In [69]:
df2[df2['pcost'] > 3000]   # filter True values/records only

   pid pname  pcost
3  104    pD   4000
4  104    pD   4000
5  105    pE   6000
6  106    pF   7000
7  107    pG   8000

In [73]:
df2[df2['pcost'] > 3000]

   pid pname  pcost
3  104    pD   4000
4  104    pD   4000
5  105    pE   6000
6  106    pF   7000
7  107    pG   8000

In [75]:
df2['value']=df2['pcost'] > 3000

In [78]:
df3=df2[['pcost','value']]

In [79]:
df3

   pcost  value
0   1000  False
1   2000  False
2   3000  False
3   4000   True
4   4000   True
5   6000   True
6   7000   True
7   8000   True

In [ ]:
# In pandas - DatFrame - mutable - inplace=True ==> modifies input DataFrame

In [80]:
# To delete a particular record
# df.drop(rowIndex)
len(df2.index)

8

In [94]:
df2=pd.DataFrame(products)
df2.drop(3)  # delete 3rd row  -> returned a DatFrame with 3rd record removed- doesnot affect original DatFrame

   pid pname  pcost
0  101    pA   1000
1  102    pB   2000
2  103    pC   3000
4  104    pD   4000
5  105    pE   6000
6  106    pF   7000
7  107    pG   8000

In [95]:
df2

   pid pname  pcost
0  101    pA   1000
1  102    pB   2000
2  103    pC   3000
3  104    pD   4000
4  104    pD   4000
5  105    pE   6000
6  106    pF   7000
7  107    pG   8000

In [96]:
len(df2.index)

8

In [97]:
df2.drop(3,inplace=True)   # ->None, DatFrame is updated

In [98]:
df2

   pid pname  pcost
0  101    pA   1000
1  102    pB   2000
2  103    pC   3000
4  104    pD   4000
5  105    pE   6000
6  106    pF   7000
7  107    pG   8000

In [99]:
len(df2.index)

7

In [100]:
print(len(df2.index))
df2.drop(4,inplace=True)  # None-> remove 4 th row from input DF
print(len(df2.index))

7
6

In [101]:
df2.drop(2,inplace=True)

In [102]:
len(df2.index)

5

In [103]:
df3=df2
print(len(df3.index))

5

In [104]:
df2.drop(1)

   pid pname  pcost
0  101    pA   1000
5  105    pE   6000
6  106    pF   7000
7  107    pG   8000

In [105]:
df4=df2
print(len(df4.index))

5

In [106]:
# To drop column
#--------------
# df.drop(columns='SingleColumnName')   VS df.drop(columns=['col1','col2','col3'])
#
df2

   pid pname  pcost
0  101    pA   1000
1  102    pB   2000
5  105    pE   6000
6  106    pF   7000
7  107    pG   8000

In [107]:
df2.drop(columns='pname')  # returns New DataFrame - but chnges not reflected in input DF

   pid  pcost
0  101   1000
1  102   2000
5  105   6000
6  106   7000
7  107   8000

In [108]:
df2

   pid pname  pcost
0  101    pA   1000
1  102    pB   2000
5  105    pE   6000
6  106    pF   7000
7  107    pG   8000

In [109]:
df2.drop(columns='pname', inplace=True)   # None- updates input DF

In [110]:
df2

   pid  pcost
0  101   1000
1  102   2000
5  105   6000
6  106   7000
7  107   8000

In [117]:
df2=pd.DataFrame(products)
df2.drop(columns=['pname','pid'], inplace=True)

In [118]:
df2

   pcost
0   1000
1   2000
2   3000
3   4000
4   4000
5   6000
6   7000
7   8000

In [119]:
df2.drop(index=[1,2,3]) # removing more than 1 record - Not updated in input DF

   pcost
0   1000
4   4000
5   6000
6   7000
7   8000

In [120]:
df2

   pcost
0   1000
1   2000
2   3000
3   4000
4   4000
5   6000
6   7000
7   8000

In [121]:
#To drop rows
#-----------------------
#  df.drop(index)       VS     df.drop(index=[index1, index2..])
df2.drop(index=[1,2,3], inplace=True)  # None. Updates input Df

In [122]:
df2

   pcost
0   1000
4   4000
5   6000
6   7000
7   8000

In [124]:
d={'k1':[10,20,30,40],
   'K2':['d1','d2','d3','d4'],
   'k3':[1.2,2.3,1.4,1.4],
    'k4':['v1','v2','v3','v4']}

# Create a DataFrame from dict
# Remove Columns K1 and K3 
# Remove row no. 2

In [126]:
pd.DataFrame(d)

   k1  K2   k3  k4
0  10  d1  1.2  v1
1  20  d2  2.3  v2
2  30  d3  1.4  v3
3  40  d4  1.4  v4

In [129]:
new_df= pd.DataFrame(d)
new_df.drop(columns=['k1','k3'], inplace=True)

In [130]:
new_df

   K2  k4
0  d1  v1
1  d2  v2
2  d3  v3
3  d4  v4

In [131]:
new_df.drop(2, inplace=True)

In [132]:
new_df

   K2  k4
0  d1  v1
1  d2  v2
3  d4  v4

In [133]:
df2.describe()

             pcost
count     5.000000
mean   5200.000000
std    2774.887385
min    1000.000000
25%    4000.000000
50%    6000.000000
75%    7000.000000
max    8000.000000

In [134]:
# rename columns
#---------------
# df.rename(columns={'oldcolumnName':'newColumnName'})
new_df

   K2  k4
0  d1  v1
1  d2  v2
3  d4  v4

In [138]:
new_df.rename(columns={'K2':'Field2'})

  Field2  k4
0     d1  v1
1     d2  v2
3     d4  v4

In [139]:
new_df

   K2  k4
0  d1  v1
1  d2  v2
3  d4  v4

In [140]:
new_df.rename(columns={'K2':'Field2'}, inplace=True)

In [141]:
new_df

  Field2  k4
0     d1  v1
1     d2  v2
3     d4  v4

In [143]:
d={'k1':[10,20,None],
   'K2':['d1',None,'d3'],
   'k3':[None,1.4,1.4],
    'k4':[None,'v3','v4']}
pd.DataFrame(d)

     k1    K2   k3    k4
0  10.0    d1  NaN  None
1  20.0  None  1.4    v3
2   NaN    d3  1.4    v4

In [147]:
d={'k1':[10,20,None],
   'K2':[30,None,None],
   'k3':[None,1.4,1.4]
    }
df3=pd.DataFrame(d)

In [148]:
df3.isnull()

      k1     K2     k3
0  False  False   True
1  False   True  False
2   True   True  False

In [149]:
df3.isnull().sum()

k1    1
K2    2
k3    1
dtype: int64

In [150]:
# To replace NaN value --> default Value  ==> fillna(<replacementValue>)
#
df3.fillna('testData')

         k1        K2        k3
0      10.0      30.0  testData
1      20.0  testData       1.4
2  testData  testData       1.4

In [151]:
df3.fillna(55)

     k1    K2    k3
0  10.0  30.0  55.0
1  20.0  55.0   1.4
2  55.0  55.0   1.4

In [152]:
df3

     k1    K2   k3
0  10.0  30.0  NaN
1  20.0   NaN  1.4
2   NaN   NaN  1.4

In [153]:
df3['k1'].fillna(44)

0    10.0
1    20.0
2    44.0
Name: k1, dtype: float64

In [155]:
df3[['K2','k3']].fillna(56.33)

      K2     k3
0  30.00  56.33
1  56.33   1.40
2  56.33   1.40

In [156]:
df3

     k1    K2   k3
0  10.0  30.0  NaN
1  20.0   NaN  1.4
2   NaN   NaN  1.4

In [157]:
df3.fillna(65.33, inplace=True)

In [158]:
df3

      k1     K2     k3
0  10.00  30.00  65.33
1  20.00  65.33   1.40
2  65.33  65.33   1.40

In [159]:
df3.isnull().sum()

k1    0
K2    0
k3    0
dtype: int64

In [160]:
d={'k1':[10,20,None],
   'K2':[30,None,None],
   'k3':[3.1,1.4,1.4]
    }
df3=pd.DataFrame(d)
df3.dropna(axis=1) #drop column

    k3
0  3.1
1  1.4
2  1.4

In [161]:
df3

     k1    K2   k3
0  10.0  30.0  3.1
1  20.0   NaN  1.4
2   NaN   NaN  1.4

In [162]:
df3.dropna(axis=1,inplace=True)

In [163]:
df3

    k3
0  3.1
1  1.4
2  1.4

In [164]:
d={'k1':[10,20,None],
   'K2':[30,None,None],
   'k3':[3.1,1.4,1.4]
    }
df3=pd.DataFrame(d)
df3.dropna(axis=0)

     k1    K2   k3
0  10.0  30.0  3.1

In [165]:
df3

     k1    K2   k3
0  10.0  30.0  3.1
1  20.0   NaN  1.4
2   NaN   NaN  1.4

In [166]:
df3.dropna(axis=0,inplace=True)

In [167]:
df3

     k1    K2   k3
0  10.0  30.0  3.1

In [168]:
pd.read_csv("D://emp.csv")    #  VS    pd.DataFrame({"k1':[...]...})

   101    Arun  sales       pune    2000
0  102  Vishnu  sales  hyderabad    3000
1  104  Raghav     Hr       pune    3000
2  105     sam     Hr     bglore    8000
3  103   Vijay   prod       Pune    2000
4  108     ram   Prod      pondy  100000
5  103   Vijay   prod       Pune    2000
6  104  Raghav     Hr       pune    3000
7  106    Hari   Prod        Chn    9000
8  107   rajen  sales      delhi   10000

In [170]:
d={'k1':[10,20,None],
   'K2':[30,None,None],
   'k3':[3.1,1.4,1.4]
    }
df3=pd.DataFrame(d)
df3.to_csv("D://res.csv")

In [171]:
pd.read_csv("D://res.csv")

   Unnamed: 0    k1    K2   k3
0           0  10.0  30.0  3.1
1           1  20.0   NaN  1.4
2           2   NaN   NaN  1.4

In [172]:
d={'k1':[10,20,None],
   'K2':[30,None,None],
   'k3':[3.1,1.4,1.4]
    }
df3=pd.DataFrame(d)
df3.to_csv("D://res.csv",index=False)  # convert DF to csv

In [174]:
pd.read_csv("D://res.csv")

     k1    K2   k3
0  10.0  30.0  3.1
1  20.0   NaN  1.4
2   NaN   NaN  1.4

In [175]:
df3.duplicated()

0    False
1    False
2    False
dtype: bool

In [176]:
df3.duplicated().sum()

np.int64(0)

In [185]:
d={'k1':[10,10,30],'k2':[10,10,30],'k3':[10,10,30]}
df4=pd.DataFrame(d)
df4

   k1  k2  k3
0  10  10  10
1  10  10  10
2  30  30  30

In [186]:
df4.duplicated()

0    False
1     True
2    False
dtype: bool

In [187]:
df4.duplicated().sum()

np.int64(1)

In [188]:
df4.drop_duplicates()

   k1  k2  k3
0  10  10  10
2  30  30  30

In [189]:
df4

   k1  k2  k3
0  10  10  10
1  10  10  10
2  30  30  30

In [190]:
df4.drop_duplicates(inplace=True)

In [191]:
df4

   k1  k2  k3
0  10  10  10
2  30  30  30

In [ ]:
# Task
#=====
# 1. Load emp.csv to pandas -> df
# 2. Get info about loaded DataFrame
# 3. List out all row index, column index
# 4. display df shape
# 5. Test- any duplicates values exists--> drop duplicated update to input DataFrame
# 6. Test - any NaN is exist -> drop index based and column based
# 7. Test - any NaN is exists -> replace row/ column default 
# 8. Rename slective columns ( ex: edept==> Dept)
# 9. Drop selective columns
# 10. Write DataFrame to External file

In [239]:
# 1. Load emp.csv to pandas -> df
df_csv = pd.read_csv("D://emp.csv")

# 2. Get info about loaded DataFrame
df_csv.info()   # df_csv.describe()

# 3. List out all row index, column index
print("Row Index : ", df_csv.index)
print("List of column : ", df_csv.columns)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   eid     11 non-null     float64
 1   ename   12 non-null     object
 2   edept   11 non-null     object
 3   ecity   12 non-null     object
 4   ecost   11 non-null     float64
dtypes: float64(2), object(3)
memory usage: 612.0+ bytes
Row Index :  RangeIndex(start=0, stop=12, step=1)
List of column :  Index(['eid', 'ename', 'edept', 'ecity', 'ecost'], dtype='object')

In [240]:
# 4. display df shape
print(df_csv.shape)   # tuple

# 5. Test- any duplicates values exists--> drop duplicated update to input DataFrame
df_csv.duplicated()
df_csv.duplicated().sum()
df_csv.drop_duplicates(inplace=True)

# 6. Test - any NaN is exist -> drop index based and column based
print(df_csv.isnull().sum())

# 7. Test - any NaN is exists -> replace row/ column default 
df_csv.dropna(inplace=True)   # default - row based
df_csv.dropna(axis=1) # column based
print(df_csv.isnull().sum())

df_csv.fillna('TestData')   # replace NaN - TestData
df_csv['edept'].fillna('commonDept')

(12, 5)
eid      1
ename    0
edept    1
ecity    0
ecost    1
dtype: int64
eid      0
ename    0
edept    0
ecity    0
ecost    0
dtype: int64

0    sales
1       Hr
2    sales
3       Hr
5     prod
6     Prod
9     Prod
Name: edept, dtype: object

In [241]:

# 8. Rename slective columns ( ex: edept==> Dept)
print(df_csv.columns)
df_csv.rename(columns={'edept':'DEPT', 'ecost':'AMOUNT'},inplace=True)
print(df_csv.columns)

Index(['eid', 'ename', 'edept', 'ecity', 'ecost'], dtype='object')
Index(['eid', 'ename', 'DEPT', 'ecity', 'AMOUNT'], dtype='object')

In [242]:
# 9. Drop selective columns
df_csv.drop(columns=['eid','ecity'], inplace=True)

In [243]:
# 10. Write DataFrame to External file
df_csv.to_csv('D://r.csv', index=False)

In [244]:
pd.read_csv('D://r.csv')

    ename   DEPT    AMOUNT
0    Arun  sales    2000.0
1     sam     Hr    8000.0
2  Vishnu  sales    3000.0
3  Raghav     Hr    3000.0
4   Vijay   prod    2000.0
5     ram   Prod  100000.0
6    Hari   Prod    9000.0

In [245]:
df_csv

    ename   DEPT    AMOUNT
0    Arun  sales    2000.0
1     sam     Hr    8000.0
2  Vishnu  sales    3000.0
3  Raghav     Hr    3000.0
5   Vijay   prod    2000.0
6     ram   Prod  100000.0
9    Hari   Prod    9000.0

In [234]:
for var in range(1,len(df_csv.index)+1):
    print(var, end=" ")

1 2 3 4 5 6 7

In [235]:
[   var for var in range(1,len(df_csv.index)+1) ]

[1, 2, 3, 4, 5, 6, 7]

In [247]:
df_csv.index

Index([0, 1, 2, 3, 5, 6, 9], dtype='int64')

In [248]:
df_csv.index=[ var for var in range(1,len(df_csv.index)+1) ]
df_csv.index

Index([1, 2, 3, 4, 5, 6, 7], dtype='int64')

In [249]:
df_csv

    ename   DEPT    AMOUNT
1    Arun  sales    2000.0
2     sam     Hr    8000.0
3  Vishnu  sales    3000.0
4  Raghav     Hr    3000.0
5   Vijay   prod    2000.0
6     ram   Prod  100000.0
7    Hari   Prod    9000.0

In [250]:
df_csv.sort_index()

    ename   DEPT    AMOUNT
1    Arun  sales    2000.0
2     sam     Hr    8000.0
3  Vishnu  sales    3000.0
4  Raghav     Hr    3000.0
5   Vijay   prod    2000.0
6     ram   Prod  100000.0
7    Hari   Prod    9000.0

In [251]:
df_csv.sort_index(ascending=False)

    ename   DEPT    AMOUNT
7    Hari   Prod    9000.0
6     ram   Prod  100000.0
5   Vijay   prod    2000.0
4  Raghav     Hr    3000.0
3  Vishnu  sales    3000.0
2     sam     Hr    8000.0
1    Arun  sales    2000.0

In [254]:
df_csv.sort_values(by="ename")   # sort emp in ascending

    ename   DEPT    AMOUNT
1    Arun  sales    2000.0
7    Hari   Prod    9000.0
4  Raghav     Hr    3000.0
5   Vijay   prod    2000.0
3  Vishnu  sales    3000.0
6     ram   Prod  100000.0
2     sam     Hr    8000.0

In [255]:
df_csv.sort_values(by="ename", ascending=False)

    ename   DEPT    AMOUNT
2     sam     Hr    8000.0
6     ram   Prod  100000.0
3  Vishnu  sales    3000.0
5   Vijay   prod    2000.0
4  Raghav     Hr    3000.0
7    Hari   Prod    9000.0
1    Arun  sales    2000.0

In [257]:
pd.read_csv("D://r.csv", index_col=0)

         DEPT    AMOUNT
ename
Arun    sales    2000.0
sam        Hr    8000.0
Vishnu  sales    3000.0
Raghav     Hr    3000.0
Vijay    prod    2000.0
ram      Prod  100000.0
Hari     Prod    9000.0

In [258]:
pd.read_csv("D://r.csv", index_col=2)

           ename   DEPT
AMOUNT
2000.0      Arun  sales
8000.0       sam     Hr
3000.0    Vishnu  sales
3000.0    Raghav     Hr
2000.0     Vijay   prod
100000.0     ram   Prod
9000.0      Hari   Prod

In [259]:
df7=pd.read_csv("D://emp.csv",index_col=2)
df7.index

Index(['sales',    'Hr', 'sales',    'Hr',    'Hr',  'prod',  'Prod',  'prod',
           nan,  'Prod', 'sales',  'Prod'],
      dtype='object', name='edept')

In [260]:
df7.columns

Index(['eid', 'ename', 'ecity', 'ecost'], dtype='object')

In [261]:
df7.loc['sales']

         eid   ename      ecity    ecost
edept
sales  101.0    Arun       pune   2000.0
sales  102.0  Vishnu  hyderabad   3000.0
sales    NaN   rajen      delhi  10000.0

In [ ]:
Data Aggregation
================
    range of values/ array  ----> scalar data (single)
[1,2323,111,333] -> min/ max/ mean ----> scalar data

np.max()
np.min()
np.mean()
np.sum()
----
df.groupby('field').sum() | max() | min()

In [263]:
products= {'pname':['pA', 'pB', 'pC', 'pA','pB', 'pA', 'pC'],
           'sales':[100,200,300,100,300,200,100]}

df=pd.DataFrame(products)
df.groupby('pname').sum()

       sales
pname
pA       400
pB       500
pC       400

In [264]:
df.groupby('pname').max()

       sales
pname
pA       200
pB       300
pC       300

In [265]:
df.groupby('pname').min()

       sales
pname
pA       100
pB       200
pC       100

In [266]:
df.groupby('pname').agg(['min','max'])

      sales
        min  max
pname
pA      100  200
pB      200  300
pC      100  300

In [267]:
df_csv

    ename   DEPT    AMOUNT
1    Arun  sales    2000.0
2     sam     Hr    8000.0
3  Vishnu  sales    3000.0
4  Raghav     Hr    3000.0
5   Vijay   prod    2000.0
6     ram   Prod  100000.0
7    Hari   Prod    9000.0

In [268]:
df_csv.to_csv('rr.csv')
df_csv.to_csv('rr.log')

In [271]:
df_csv.to_csv('rr.log', sep=":")
pd.read_csv('rr.log')

      :ename:DEPT:AMOUNT
0    1:Arun:sales:2000.0
1        2:sam:Hr:8000.0
2  3:Vishnu:sales:3000.0
3     4:Raghav:Hr:3000.0
4    5:Vijay:prod:2000.0
5    6:ram:Prod:100000.0
6     7:Hari:Prod:9000.0

In [272]:
pd.read_csv('rr.log', sep=":")

   Unnamed: 0   ename   DEPT    AMOUNT
0           1    Arun  sales    2000.0
1           2     sam     Hr    8000.0
2           3  Vishnu  sales    3000.0
3           4  Raghav     Hr    3000.0
4           5   Vijay   prod    2000.0
5           6     ram   Prod  100000.0
6           7    Hari   Prod    9000.0

In [ ]:
pd.read_excel("input.xlsx")
pd.read_excel("input.xlsx",sheet_name="Sheet1")

In [ ]:
Python ----------------python DB Modules--------------------DataBase
DS                                                             SQL

'insert into .. values..'   // str  ----------------->      sql> select *..->records
  -----------------------------------------------------------------|
  [] () [(),()]

In [273]:
import sqlite3

In [274]:
conn= sqlite3.connect('test1.db')
sth= conn.cursor()
sth.execute('create table pn(id INT, pname Text, pcost REAL)')

In [276]:
sth.execute("insert into pn(id,pname,pcost) values(101,'pA',1000)")
va=102
vb="pB"
vc=2000
sth.execute('insert into pn(id,pname,pcost) values(?,?,?)', (va,vb,vc))

In [277]:
sth.execute("insert into pn(id,pname,pcost) values(103,'pB',3000)")
sth.execute("insert into pn(id,pname,pcost) values(111,'pD',5000)")

In [278]:
sth.execute("select * from pn")

In [279]:
list(sth)  # generator

[(101, 'pA', 1000.0),
 (102, 'pB', 2000.0),
 (103, 'pB', 3000.0),
 (111, 'pD', 5000.0)]

In [280]:
sth.execute("select * from pn")

sth.fetchall() # method

[(101, 'pA', 1000.0),
 (102, 'pB', 2000.0),
 (103, 'pB', 3000.0),
 (111, 'pD', 5000.0)]

In [281]:
sth.execute("select * from pn")
sth.fetchone()

(101, 'pA', 1000.0)

In [282]:
sth.fetchone()

(102, 'pB', 2000.0)

In [283]:
conn.commit()
conn.close()

In [284]:
import sqlite3
conn=sqlite3.connect('test1.db')
pd.read_sql_query('select * from pn',conn)  # --> df

    id pname   pcost
0  101    pA  1000.0
1  102    pB  2000.0
2  103    pB  3000.0
3  111    pD  5000.0

In [ ]:
pd.DataFrame({key:[]}) -> df
pd.read_csv('inputFile')  -> df
pd.read_sql_query('select query statement', connection_obj) -> df

In [ ]:
ETL  (Extract- Transform - Load)
================================
Data- Extract from DAtaSource( File,API,DB...) -> Transform(Clean,Aggregation)-->Load(Load to target DatawareHouse)

ELT  (Exxtract - Load - Transform)
==================================
Dat - Extract from DAtaSource( File,API,DB...) -> Load this to target system ---> Transform(Clean,Aggregation)

In [285]:
def fx(a1,a2):
    return a1+a2
fx(10,20)

30

In [286]:
fy=lambda a,b:a+b
fy(10,20)

30

In [288]:
df=pd.DataFrame({'name':['A','B','C'], 'cost':[1000,2000,3000]})
df

  name  cost
0    A  1000
1    B  2000
2    C  3000

In [289]:
#df.apply(functionName)
df['Tax']=df['cost'].apply(lambda a:a*0.18)
df

  name  cost    Tax
0    A  1000  180.0
1    B  2000  360.0
2    C  3000  540.0

In [ ]:
#Task
#====
# Extract - Transform - Load
# product.csv
# read product.csv -->  Extract
# w.r.t  product cost - apply tax  #  Transform
# Load - create a new database file

In [301]:
L=[]
for var in range(1,6):
    if(var>3):
        L.append(var+100)
    else:
        L.append(var+500)
L

[501, 502, 503, 104, 105]

In [302]:
[var+100  if var>3  else var+500  for var in range(1,6)]

[501, 502, 503, 104, 105]

In [309]:
# Extract
df_prod= pd.read_csv("D://products.csv")
df_prod.info()
print(df_prod)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   pid     3 non-null      int64
 1   pname   3 non-null      object
 2   pcost   3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 204.0+ bytes
   pid pname  pcost
0  101    pA   1000
1  102    pB   2000
2  103    pC   3000

In [310]:
#Transform
df_prod['updated_cost'] = df_prod.apply(lambda a: a['pcost'] * 0.18 if a['pname'] == 'pC' else a['pcost'], axis=1)
df_prod

   pid pname  pcost  updated_cost
0  101    pA   1000        1000.0
1  102    pB   2000        2000.0
2  103    pC   3000         540.0

In [313]:
#Load- Load raw data
import sqlite3
conn= sqlite3.connect("products.db")
df_prod.to_sql('product',conn,if_exists="replace", index=False)   # Loaded to DB

3

In [314]:
#Testing
list(conn.execute('select * from product'))  # applying generatory tech

[(101, 'pA', 1000, 1000.0),
 (102, 'pB', 2000, 2000.0),
 (103, 'pC', 3000, 540.0)]

In [315]:
for var in conn.execute('select * from product'):
    print(var)

(101, 'pA', 1000, 1000.0)
(102, 'pB', 2000, 2000.0)
(103, 'pC', 3000, 540.0)

In [ ]:
## ELT
#1. Extract product.csv
#2. Load same product.csv --> DB
#3. Transform - use SQL Query

In [316]:
# Extract
df_prod= pd.read_csv("D://products.csv")
df_prod.info()
print(df_prod)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   pid     3 non-null      int64
 1   pname   3 non-null      object
 2   pcost   3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 204.0+ bytes
   pid pname  pcost
0  101    pA   1000
1  102    pB   2000
2  103    pC   3000

In [317]:
#Load - Load raw data
import sqlite3
conn= sqlite3.connect("products1.db")
df_prod.to_sql('product_raw',conn,if_exists="replace", index=False)   # Loaded to DB

3

In [318]:
#Transform (inside db) - SQl Query  Not Python programming logic
conn.execute(""" create table product_final as
                 SELECT pid,
                 pname,
                 pcost,
                 CASE
                     when pname= 'pC' THEN pcost * 0.18
                 ELSE pcost
                END AS updatecost
                FROM product_raw;
                """
            )
conn.commit()

In [ ]:
#Testing
for var in conn.execute(select * from product_)